Documents/УвольнениеИзОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>УвольнениеИзОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<BasedOn>
				<xr:Item>Catalog.СотрудникиОрганизаций</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Работники</xr:Item>
				<xr:Item>InformationRegister.ВзносыВФондыРаботниковОрганизаций</xr:Item>
				<xr:Item>InformationRegister.РаботникиОрганизаций</xr:Item>
				<xr:Item>InformationRegister.ПлановыеУдержанияРаботниковОрганизаций</xr:Item>
				<xr:Item>InformationRegister.ЛьготыРаботниковОрганизаций</xr:Item>
				<xr:Item>InformationRegister.ПлановыеНачисленияРаботниковОрганизаций</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВУпрУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВРеглУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РаботникиОрганизации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Физлицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаУвольнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОснованиеУвольнения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОснованияУвольненийИзОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаУвольнения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОснованияУвольнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УвольнятьВУпрУчете</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПриказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ОтветственныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеЛицаОрганизаций</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбособленныеПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ОтветственныеЛицаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ФИОФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ФИОФизЛиц</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПринятНаНовоеРабочееМесто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаботаСНефиксированнымРабочимВременем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УдалитьПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСозданияРабочегоМеста</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНовогоРабочегоМеста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНовыхРабочихМест</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяКЗоТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияУвольненийИзОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПлановыеНачисленияРаботниковОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПлановыеНачисленияРаботниковОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНачисленийРаботникаОрганизации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта4</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель5</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта5</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель6</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта6</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияВУпрУчете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВУпрУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДействияСНачислением</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидУчетаВремениДляСредней</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчетаВремениДляСредней</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Назначение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасчетаИзмерение</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДоговорНаВыполнениеРаботСФизЛицом</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/УвольнениеИзОрганизаций/Ext/ObjectModule.bsl
Перем мУдалятьДвижения;
Перем мДлинаСуток;
Перем мОтказ;

////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
//

// Формирует запрос по документу
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросДляПечати(Режим)

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	Запрос.УстановитьПараметр("Руководитель", Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
	Запрос.УстановитьПараметр("ДатаДокумента", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);

	Если Режим = "ПоРеквизитамДокумента" Тогда

		Запрос.Текст =
		"ВЫБРАТЬ Разрешенные
		|	ОтветственныеЛицаОрганизацийСрезПоследних.Должность КАК ДолжностьРуководителя,
		|	УвольнениеИзОрганизаций.Номер КАК НомерДок,
		|	УвольнениеИзОрганизаций.Дата КАК ДатаДок,
		|	УвольнениеИзОрганизаций.Организация.НаименованиеПолное КАК НазваниеОрганизации,
		|	ВЫБОР КОГДА (ФИОФизЛицСрезПоследних.ФизЛицо) ЕСТЬ NULL  ТОГДА ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо.Наименование ИНАЧЕ ФИОФизЛицСрезПоследних.Фамилия + ВЫБОР КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) <> """" ТОГДА "" "" + ФИОФизЛицСрезПоследних.Имя ИНАЧЕ """" КОНЕЦ + ВЫБОР КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) <> """" ТОГДА "" "" + ФИОФизЛицСрезПоследних.Отчество ИНАЧЕ """" КОНЕЦ КОНЕЦ КАК ФИОРуководителя
		|ИЗ
		|	Документ.УвольнениеИзОрганизаций КАК УвольнениеИзОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&ДатаДокумента, ) КАК ОтветственныеЛицаОрганизацийСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаДокумента, ) КАК ФИОФизЛицСрезПоследних
		|			ПО ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
		|		ПО (ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо = &Руководитель) И УвольнениеИзОрганизаций.Организация = ОтветственныеЛицаОрганизацийСрезПоследних.СтруктурнаяЕдиница
		|
		|ГДЕ
		|	УвольнениеИзОрганизаций.Ссылка = &ДокументСсылка";

	ИначеЕсли Режим = "ПоТабличнойЧастиДокумента" Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ Разрешенные
		|	ВЫБОР КОГДА (ФИОФизЛицСрезПоследних.Фамилия) ЕСТЬ NULL  ТОГДА УвольненияИзОрганизацийРаботники.Физлицо.Наименование ИНАЧЕ ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество КОНЕЦ КАК Работник,
		|	УвольненияИзОрганизацийРаботники.НомерСтроки,
		|	УвольненияИзОрганизацийРаботники.Сотрудник,
		|	УвольненияИЗОрганизацийРаботники.Сотрудник.Должность.Категория,
		|	УвольненияИзОрганизацийРаботники.ДатаУвольнения,
		|	УвольненияИзОрганизацийРаботники.ОснованиеУвольнения.СтатьяЗакона КАК ОснованиеУвольнения,
		|	УвольненияИзОрганизацийРаботники.ПричинаУвольнения,
		|	Работники.ПодразделениеОрганизации КАК Подразделение,
		|	Работники.Должность,
		|	Работники.Категория,
		|	УвольненияИзОрганизацийРаботники.Сотрудник.Код КАК ТабельныйНомер
		|ИЗ
		|	Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольненияИзОрганизацийРаботники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаДокумента, ФизЛицо В (ВЫБРАТЬ РАЗЛИЧНЫЕ УвольненияИзОрганизацийРаботники.Физлицо ИЗ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольненияИзОрганизацийРаботники ГДЕ 	УвольненияИзОрганизацийРаботники.Ссылка = &ДокументСсылка )) КАК ФИОФизЛицСрезПоследних
		|		ПО УвольненияИзОрганизацийРаботники.Сотрудник.Физлицо = ФИОФизЛицСрезПоследних.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СписокДат.Сотрудник КАК Сотрудник,
		|			СписокДат.Сотрудник.ФизЛицо КАК ФизЛицо,
		|			РаботникиОрганизации.ПодразделениеОрганизации.Наименование КАК ПодразделениеОрганизации,
		|			РаботникиОрганизации.Должность.Наименование КАК Должность,
		|			РаботникиОрганизации.Должность.Категория КАК Категория,
		|			РаботникиОрганизации.Сотрудник.Код КАК ТабельныйНомер
		|		ИЗ
		|			(ВЫБРАТЬ
		|				РаботникиВнутри.Сотрудник КАК Сотрудник,
		|				РаботникиВнутри.Сотрудник.ФизЛицо КАК ФизЛицо,
		|				МАКСИМУМ(РаботникиВнутри.Период) КАК ДатаПоследнегоИзменения
		|			ИЗ
		|				РегистрСведений.РаботникиОрганизаций КАК РаботникиВнутри
		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК Док
		|					ПО РаботникиВнутри.Сотрудник = Док.Сотрудник И (РаботникиВнутри.Организация = &Организация)И РаботникиВнутри.Период <= Док.ДатаУвольнения
		|			
		|			ГДЕ
		|				Док.Ссылка = &ДокументСсылка
		|			
		|			СГРУППИРОВАТЬ ПО
		|				РаботникиВнутри.Сотрудник,
		|				РаботникиВнутри.Сотрудник.ФизЛицо) КАК СписокДат
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
		|				ПО СписокДат.Сотрудник = РаботникиОрганизации.Сотрудник И СписокДат.ДатаПоследнегоИзменения = РаботникиОрганизации.Период) КАК Работники
		|		ПО УвольненияИзОрганизацийРаботники.Сотрудник = Работники.Сотрудник
		|
		|ГДЕ
		|	УвольненияИзОрганизацийРаботники.Ссылка = &ДокументСсылка";

	Иначе
		Возврат Неопределено
	КонецЕсли;

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросДляПечати()


#Если Клиент Тогда
Функция ПечатьП8()
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УвольнениеИзОрганизации_П8";
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	// получаем данные для печати
	ВыборкаДляШапки   = СформироватьЗапросДляПечати("ПоРеквизитамДокумента").Выбрать();
	ВыборкаДляШапки.Следующий();
	ВыборкаРаботники = СформироватьЗапросДляПечати("ПоТабличнойЧастиДокумента").Выбрать();
	СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Организация, Дата);

	// запоминаем области макета
	Макет = ПолучитьМакет("П8_от_09_10_1995");
	ОбластьМакета = Макет.ПолучитьОбласть("Форма");

	// выводим данные о руководителях организации
    Если ВыборкаДляШапки.Следующий() Тогда
		ОбластьМакета.Параметры.Заполнить(ВыборкаДляШапки); // данные из шапки
	КонецЕсли;
	
	// Начинаем формировать выходной документ
	Пока ВыборкаРаботники.Следующий() Цикл

		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Регистратор,
		|	Показатель1 Как Размер	
		|ИЗ
		|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&парамДата, Сотрудник = &парамСотрудник И Организация = &парамОрганизация)
		|ГДЕ
		| ВидРасчета <> ВидРасчетаИзмерение
		|";
		Запрос.УстановитьПараметр("парамДата", ВыборкаРаботники.ДатаУвольнения);
	    Запрос.УстановитьПараметр("парамСотрудник", ВыборкаРаботники.Сотрудник);
		Запрос.УстановитьПараметр("парамОрганизация", Организация);
		
		ОкладПрежний = Запрос.Выполнить().Выбрать();
		Пока ОкладПрежний.Следующий() Цикл
			ПрежнийОклад = ОкладПрежний.Размер;	
		КонецЦикла;
		
		// Каждый приказ на отдельной странице.
		Если ТабДокумент.ВысотаТаблицы > 0 Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ОбластьМакета.Параметры.Заполнить(ВыборкаДляШапки); // данные из шапки
		ОбластьМакета.Параметры.НазваниеОрганизации = СведенияОбОрганизации.ПолноеНаименование;
		ОбластьМакета.Параметры.ЕДРПОУ = УправлениеКонтактнойИнформацией.ПолучитьКодОрганизации(СведенияОбОрганизации);
		
		// Данные по работнику.
		ОбластьМакета.Параметры.Заполнить(ВыборкаРаботники);
		ОбластьМакета.Параметры["ПрежнийОкладТарифнаяСтавка"] = ПрежнийОклад;
		
		ТабДокумент.Вывести(ОбластьМакета);
        	
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьП8()

Функция ПечатьП4()
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УвольнениеИзОрганизации_П4";
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	// получаем данные для печати
	ВыборкаДляШапки   = СформироватьЗапросДляПечати("ПоРеквизитамДокумента").Выбрать();
	ВыборкаДляШапки.Следующий();
	ВыборкаРаботники = СформироватьЗапросДляПечати("ПоТабличнойЧастиДокумента").Выбрать();
	СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Организация, Дата);

	// запоминаем области макета
	Макет = ПолучитьМакет("П4_от_05_12_2008");
	ОбластьМакета = Макет.ПолучитьОбласть("Форма");

	// выводим данные о руководителях организации
    Если ВыборкаДляШапки.Следующий() Тогда
		ОбластьМакета.Параметры.Заполнить(ВыборкаДляШапки); // данные из шапки
	КонецЕсли;
	
	// Начинаем формировать выходной документ
	Пока ВыборкаРаботники.Следующий() Цикл

		// Каждый приказ на отдельной странице.
		Если ТабДокумент.ВысотаТаблицы > 0 Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ОбластьМакета.Параметры.Заполнить(ВыборкаДляШапки); // данные из шапки
		ОбластьМакета.Параметры.ФИОРуководителя = ОбщегоНазначения.ИмяФамилияВФорматеДСТУ(ОбластьМакета.Параметры.ФИОРуководителя);	
		
		ОбластьМакета.Параметры.НазваниеОрганизации = ВРег(СведенияОбОрганизации.ПолноеНаименование);
		ОбластьМакета.Параметры.ЕДРПОУ = УправлениеКонтактнойИнформацией.ПолучитьКодОрганизации(СведенияОбОрганизации);
		
		// Данные по работнику.
		ОбластьМакета.Параметры.Заполнить(ВыборкаРаботники);
		
		ТабДокумент.Вывести(ОбластьМакета);
        	
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьП8()

//{NB 18.02.2025
Функция ПечатьП4_отпуска()
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УвольнениеИзОрганизации_П4";
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	// получаем данные для печати
	ВыборкаДляШапки   = СформироватьЗапросДляПечати("ПоРеквизитамДокумента").Выбрать();
	ВыборкаДляШапки.Следующий();
	ВыборкаРаботники = СформироватьЗапросДляПечати("ПоТабличнойЧастиДокумента").Выбрать();
	СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Организация, Дата);

	// запоминаем области макета
	Макет = ПолучитьМакет("П4_отпуска");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьОтпуск = Макет.ПолучитьОбласть("Отпуска");
	ОбластьПодпись = Макет.ПолучитьОбласть("Подпись");

	// выводим данные о руководителях организации
    Если ВыборкаДляШапки.Следующий() Тогда
		ОбластьШапка.Параметры.Заполнить(ВыборкаДляШапки); // данные из шапки
	КонецЕсли;
	
	// Начинаем формировать выходной документ
	Пока ВыборкаРаботники.Следующий() Цикл

		// Каждый приказ на отдельной странице.
		Если ТабДокумент.ВысотаТаблицы > 0 Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ОбластьШапка.Параметры.Заполнить(ВыборкаРаботники); // данные из шапки
		ОбластьПодпись.Параметры.ФИОРуководителя = ОбщегоНазначения.ИмяФамилияВФорматеДСТУ(ВыборкаДляШапки.ФИОРуководителя);	
		
		ОбластьШапка.Параметры.НазваниеОрганизации = ВРег(СведенияОбОрганизации.ПолноеНаименование);
		ОбластьШапка.Параметры.ЕДРПОУ = УправлениеКонтактнойИнформацией.ПолучитьКодОрганизации(СведенияОбОрганизации);
		
		// Данные по работнику.
		ОбластьШапка.Параметры.Заполнить(ВыборкаРаботники);
		
		ТабДокумент.Вывести(ОбластьШапка);
		ВывестиОстаткиОтпуска(ТабДокумент, ОбластьОтпуск, ВыборкаРаботники);
		ТабДокумент.Вывести(ОбластьПодпись);		
        	
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьП8()

Процедура ВывестиОстаткиОтпуска(ТабДок, Область, Работник)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаОтчета", Работник.ДатаУвольнения);
	Запрос.УстановитьПараметр("Причина", Перечисления.ПричиныИзмененияСостояния.Увольнение);
	Запрос.УстановитьПараметр("Сотрудник", Работник.Сотрудник);
//	Запрос.УстановитьПараметр("Организация", Работник.Ор);
	Запрос.УстановитьПараметр("ВидОтпуска", ПланыВидовРасчета.Начисления.ОплатаПоСреднемуОтп);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РаботникиОрганизации.Сотрудник,
	               |	РаботникиОрганизации.Организация КАК Организация,
	               |	&ДатаОтчета КАК ДатаОкончания,
	               |	ПоложенныеОтпуска.ВидОтпуска,
	               |	Увольнение.Период КАК ДатаУвольнения
	               |ПОМЕСТИТЬ ВТРаботникиОрганизации
	               |ИЗ
	               |	РегистрСведений.РаботникиОрганизаций.СрезПервых(, Сотрудник = &Сотрудник) КАК РаботникиОрганизации
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоложенныеЕжегодныеОтпускаРаботников.СрезПоследних(&ДатаОтчета, Сотрудник = &Сотрудник) КАК ПоложенныеОтпуска
	               |		ПО РаботникиОрганизации.Сотрудник = ПоложенныеОтпуска.Сотрудник
	               |			И РаботникиОрганизации.Организация = ПоложенныеОтпуска.Организация
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			Рабы.Организация КАК Организация,
	               |			Рабы.Сотрудник КАК Сотрудник,
	               |			Рабы.Период КАК Период
	               |		ИЗ
	               |			РегистрСведений.РаботникиОрганизаций.СрезПоследних(, Сотрудник = &Сотрудник) КАК Рабы
	               |		ГДЕ
	               |			Рабы.ПричинаИзмененияСостояния = &Причина) КАК Увольнение
	               |		ПО РаботникиОрганизации.Сотрудник = Увольнение.Сотрудник
	               |			И РаботникиОрганизации.Организация = Увольнение.Организация";
	Запрос.Выполнить();
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТРаботникиОрганизации";
	
	//Получаем таблицу остатков отпусков
	ПроцедурыУправленияПерсоналом.ПолучитьТаблицуОстатковДнейОтпуска(Запрос.МенеджерВременныхТаблиц);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	РаботникиОрганизации.Сотрудник КАК Сотрудник,
	               |	РаботникиОрганизации.ВидОтпуска КАК ВидОтпуска,
	               |	РаботникиОрганизации.Организация КАК Организация,
	               |	ОсталосьДнейОтпуска.РабочийПериодНачало КАК РабочийПериодНачало,
	               |	ОсталосьДнейОтпуска.РабочийПериодокончание КАК РабочийПериодОкончание,
	               |	ЕСТЬNULL(ОсталосьДнейОтпуска.ПоложеноДнейОтпуска, 0) КАК ПоложеноДнейОтпуска,
	               |	ЕСТЬNULL(ОсталосьДнейОтпуска.ИспользованоДнейОтпуска, 0) КАК ИспользованоДнейОтпуска,
	               |	ЕСТЬNULL(ОсталосьДнейОтпуска.ОстатокДнейОтпуска, 0) КАК ОстатокДнейОтпуска
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		РаботникиОрганизации.Сотрудник КАК Сотрудник,
	               |		РаботникиОрганизации.ВидОтпуска КАК ВидОтпуска,
	               |		РаботникиОрганизации.Организация КАК Организация
	               |	ИЗ
	               |		ВТРаботникиОрганизации КАК РаботникиОрганизации
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		РаботникиОрганизации.Сотрудник,
	               |		РаботникиОрганизации.ВидОтпуска,
	               |		РаботникиОрганизации.Организация) КАК РаботникиОрганизации
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстатокДнейОтпуска КАК ОсталосьДнейОтпуска
	               |		ПО РаботникиОрганизации.Сотрудник = ОсталосьДнейОтпуска.Сотрудник
	               |			И РаботникиОрганизации.ВидОтпуска = ОсталосьДнейОтпуска.ВидОтпуска
	               |			И РаботникиОрганизации.Организация = ОсталосьДнейОтпуска.Организация
	               |ГДЕ
	               |	РаботникиОрганизации.Сотрудник = &Сотрудник
	               |	И РаботникиОрганизации.ВидОтпуска = &ВидОтпуска
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РаботникиОрганизации.Сотрудник,
	               |	РаботникиОрганизации.ВидОтпуска,
	               |	РаботникиОрганизации.Организация,
	               |	ОсталосьДнейОтпуска.РабочийПериодНачало,
	               |	ОсталосьДнейОтпуска.РабочийПериодокончание,
	               |	ОсталосьДнейОтпуска.ПоложеноДнейОтпуска,
	               |	ОсталосьДнейОтпуска.ИспользованоДнейОтпуска,
	               |	ОсталосьДнейОтпуска.ОстатокДнейОтпуска
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ОсталосьДнейОтпуска.РабочийПериодНачало,
	               |	ОсталосьДнейОтпуска.РабочийПериодокончание
				   |";

	Рез = Запрос.Выполнить().Выгрузить();
	
	ПериодыОтпуска= "";
	ВсегоОсталось = 0;
	Для Каждого ГодОтп из Рез Цикл 
		ОсталосьПропорц = ПроцедурыУправленияПерсоналом.ПолучитьОстатокОтпускаПропорционально(ГодОтп.РабочийПериодОкончание, 
								Работник.ДатаУвольнения, ГодОтп.РабочийПериодНачало, ГодОтп.РабочийПериодОкончание, 
								ГодОтп.ПоложеноДнейОтпуска, ГодОтп.ОстатокДнейОтпуска, ГодОтп.ИспользованоДнейОтпуска, 0);
		Если  ОсталосьПропорц >0 Тогда 
			ПериодыОтпуска = Символы.ПС + Строка(ОсталосьПропорц)+ " к. дн. за робочий період "+Формат(ГодОтп.РабочийПериодНачало,"ДФ=dd.MM.yyyy")
										+" по "+Формат(ГодОтп.РабочийПериодОкончание,"ДФ=dd.MM.yyyy")+" р.";
			ВсегоОсталось = ВсегоОсталось+ОсталосьПропорц;	
		КонецЕсли;
	КонецЦикла;	
	Если ВсегоОсталось>0 Тогда 
		Область.Параметры.Отпуск = "Компенсація за невикористану основну щорічну відпустку "+КалендарДней(ВсегоОсталось);
		ТабДок.Вывести(Область);
		Область.Параметры.Отпуск = ПериодыОтпуска;
		ТабДок.Вывести(Область);
	КонецЕсли;	
	
КонецПроцедуры

Функция КалендарДней(ЧислоДн)
	Симв2 = Прав(Строка(ЧислоДн),2);
	Симв1 = Прав(Строка(ЧислоДн),1);
	
	Рез = "";
	Если Найти("5,6,7,8,9,0", Симв1) Или Найти("11,12,13", Симв2) Тогда 
		Возврат Строка(ЧислоДн)+" календарних днів";
	ИначеЕсли Найти("1", Симв1) Тогда 
		Возврат Строка(ЧислоДн)+" календарний день";
	Иначе 
		Возврат Строка(ЧислоДн)+" календарні дні";
	КонецЕсли;
		
КонецФункции
//}

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	// Получить экземпляр документа на печать
	Если ИмяМакета = "П8_от_09_10_1995" Тогда
 		ТабДокумент = ПечатьП8();
	ИначеЕсли ИмяМакета = "П4_от_05_12_2008" Тогда
 		ТабДокумент = ПечатьП4();	
	ИначеЕсли ИмяМакета = "П4_отпуска" Тогда //{NB 18.02.2025
 		ТабДокумент = ПечатьП4_отпуска();	
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект,НСтр("ru='Увольнение ';uk='Звільнення '")), Ссылка);
	
КонецПроцедуры // Печать

#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	
	СтруктураМакетов = Новый Структура;
	
	СтруктураМакетов.Вставить("П4_от_05_12_2008", НСтр("ru='Форма П-4';uk='Форма П-4'"));
	СтруктураМакетов.Вставить("П8_от_09_10_1995", НСтр("ru='Форма П-8 (от 09.10.1995)';uk='Форма П-8 (від 09.10.1995)'"));
	СтруктураМакетов.Вставить("П4_отпуска", НСтр("ru='Форма П-4 (отпуска)';uk='Форма П-4(відпустки)'")); //{NB 19.02.2025

	Возврат СтруктураМакетов;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ РАБОТЫ ФОРМ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Формирует запрос по шапке документа
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросПоШапке(Режим)

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
	Запрос.УстановитьПараметр("ПустаяОрганизация" , Справочники.Организации.ПустаяСсылка());

	Запрос.Текст = "
	|Выбрать 
	|	Дата, 
	|	Организация,
	|	ОтражатьВУпрУчете,
	|	ОтражатьВРеглУчете,
	|	Организация  КАК ГоловнаяОрганизация,
	| 	Ссылка 
	|Из 
	|	Документ." + Метаданные().Имя + "
	|Где 
	|	Ссылка = &ДокументСсылка
	|";

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоШапке()

// Формирует запрос по таблице "РаботникиОрганизации" документа
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса. В запросе данные документа дополняются данными о 
//  работниках из регистра сведений РаботникиОрганизации и о начислениях
//  и удержаниях из регистров сведений 
//
Функция СформироватьЗапросПоРаботникиОрганизаций(ВыборкаПоШапкеДокумента, Режим)

	Запрос = Новый Запрос;

	// Заполним список обособленных подразделений организации 
	ГоловнаяОрганизация = ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
	СписокСтруктурныхПодразделений = ПроцедурыУправленияПерсоналом.ПолучитьСписокОбособленныхПодразделенийОрганизации(ГоловнаяОрганизация);
	СписокСтруктурныхПодразделений.Добавить(ГоловнаяОрганизация);

	УчетнаяПолитикаПоПерсоналуОрганизации = глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации");
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	Запрос.УстановитьПараметр("СписокСтруктурныхПодразделений", СписокСтруктурныхПодразделений);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("ОсновноеМестоРаботы", Перечисления.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы);
	Запрос.УстановитьПараметр("Прием" ,      Перечисления.ПричиныИзмененияСостояния.ПриемНаРаботу);
	Запрос.УстановитьПараметр("МассивФизЛиц", РаботникиОрганизации.ВыгрузитьКолонку("ФизЛицо"));

    // Описание текста запроса:
	// Первая часть запроса  - вид строки запроса "ДанныеДляДвиженийКадров": 
    // 1. Выборка "ТЧРаботникиОрганизации": 
	//		Выбираются строки документа.  
	// 2. Выборка "ПриказыОПриеме"
	//		Присоединяем данные о приказах-приемах на работу с целью проверки соответствия выбранных приказов физлицам и организации
	//		(приказ о приеме может быть оформлен от лица любого структурного подразделения организации)
	// 3. Выборка "ДанныеПоРаботникиДоНазначения": 
	//		Для каждой строки ТЧРаботникиОрганизации выполняем срез по регистру РаботникиОрганизаций на дату ДатаНачала
	//		для выполнения движений и проверки "Работает ли работник на дату перемещения" в указанной организации (структурном подразделении). 
	//		(Использует данные выборки "ДатыПоследнихДвиженийРаботников")
	// 4. Выборка "ПересекающиесяСтроки": 
	//		Среди остальных строк документа ищем строки, имеющие одиноковый набор реквизитов <ФизЛицо, Приказ>.
	//
	// Вторая часть запроса - вид строки запроса "НачисленияРаботникаОрганизации" - выборка открытых начислений и удержаний работника для их закрытия
	// 1. Выборка "ТЧРаботникиОрганизации":
	//		Выбираются строки документа 
	// 2. Выборка "СписокВидовРасчета":
	//		Для каждой строки ТЧРаботникиОрганизации по регистрам ПлановыеНачисленияРаботниковОрганизаций выполняем срез последних на дату ДатаУвольнения (выборка СписокВидовРасчета).
	//		Для закрытия нужны только те строки начислений и удержаний, ресурс "Размер" которых не равен нулю.
	//		Удержания физлица закрываем по всем структруным подразделениям только в момент увольнения с основного места работы.

	// Третья часть запроса - вид строки запроса "РабочиеМестаДоУвольнения" - выборка остающихся мест работы после увольнения
	// Данные выборки нужня для проверки "Работник не может быть уволен с основного места работы до тех пор, пока он оформлен внутренним совместителем"
	// 1. Выборка "ТЧРаботникиОрганизации":
	//		Выбираются строки документа 
	// 2. Выборка "ДанныеПоРаботникуДоУвольнения":
	//		Для каждой строки ТЧРаботникиОрганизации выполняем срез по выборке "ДвиженияРаботниковОрганизации" регистру РаботникиОрганизаций на дату ДатаУвольнения.
	//		Где выборка "ДвиженияРаботниковОрганизации" есть объединение движений по регистру "РаботникиОрганизаций" и движений, которые должны выполниться
	//		проверяемым документом. 

	// Четвертая часть запроса - вид строки запроса "КонфликтныйДокумент" - поиск конфликтных документов: 
	// 1. Выборка "ТЧРаботникиОрганизации":
	//		Выбираются строки документа 
   	// 2. Выборка "КонфликтныеДвижения":
	//		Для каждой строки ТЧРаботникиОрганизации ищем движения по регистрам РаботникиОрганизаций
	//		на дату ДатаУвольнения по набору измерений <ФизЛицо, Приказ>

	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""ДанныеДляДвиженийКадров"" КАК ВидСтрокиЗапроса,
	|	ТЧРаботникиОрганизации.НомерСтроки КАК НомерСтроки,
	|	ТЧРаботникиОрганизации.Сотрудник,
	|	ТЧРаботникиОрганизации.Сотрудник.Наименование КАК СотрудникНаименование,
	|	ТЧРаботникиОрганизации.ДатаУвольнения,
	|	ТЧРаботникиОрганизации.ОснованиеУвольнения,
	|	ТЧРаботникиОрганизации.ПричинаУвольнения,
	|	ТЧРаботникиОрганизации.УвольнятьВУпрУчете,	
	|	ТЧРаботникиОрганизации.Сотрудник.ВидЗанятости КАК ВидЗанятости,
	|	ДанныеПоРаботникуДоНазначения.ПодразделениеОрганизации КАК ПрежнееПодразделение,
	|	ДанныеПоРаботникуДоНазначения.ПодразделениеОрганизации.Владелец КАК ПрежняяОрганизация,
	|	ДанныеПоРаботникуДоНазначения.Должность КАК ПрежняяДолжность,
	|	ВЫБОР КОГДА (ПриказыОПриеме.Сотрудник) ЕСТЬ NULL  ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ОшибкаВПриказеОПриемеНетФизЛица,
	|	ВЫБОР КОГДА НЕ(ПриказыОПриеме.Ссылка.Организация В (&СписокСтруктурныхПодразделений)) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ОшибкаНеСоответствиеОрганизацииПриказаОПриеме,
	|	
	|	ДанныеПоРаботникуДоНазначения.Период КАК ДатаПоследнегоДвиженияПоРаботнику,
	|";
	ТекстЗапроса = ТекстЗапроса + ?(ОтражатьВУпрУчете,"
	|	ДанныеПоРаботникуДоНазначенияУпр.Подразделение КАК ПрежнееПодразделениеУпр,
	|","
	|	NULL КАК ПрежнееПодразделениеУпр,
	|");	
	ТекстЗапроса = ТекстЗапроса + "
	|	ПересекающиесяСтроки.КонфликтнаяСтрокаНомер,
	|	NULL КАК ВидРасчетаИзмерение,
	|	NULL КАК ВидРасчета,
	|	NULL КАК ДокументОснованиеРасчета,
	|	NULL КАК КонфликтныйДокумент,
	|	NULL КАК ВидЗанятостиПоДругомуМестуРаботы
	|ИЗ
	|	Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК ТЧРаботникиОрганизации
	|	
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ПриказыОПриеме
	|		ПО 
	|			ПриказыОПриеме.Сотрудник = ТЧРаботникиОрганизации.Сотрудник 
	|			И 
	|			(ТЧРаботникиОрганизации.Ссылка.Проведен)
	|			И 
	|			(ПриказыОПриеме.Ссылка.Проведен)
	|	
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ДанныеПоРаботникуДоНазначения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				Док.Сотрудник КАК Сотрудник,
	|				МАКСИМУМ(СостояниеВнутри.Период) КАК ДатаПоследнегоИзменения
	|			ИЗ
	|				РегистрСведений.РаботникиОрганизаций КАК СостояниеВнутри
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК Док
	|					ПО СостояниеВнутри.Сотрудник= Док.Сотрудник 
	|						И (СостояниеВнутри.Организация = &ГоловнаяОрганизация)
	|						И (Док.Ссылка = &ДокументСсылка) 
	|						И СостояниеВнутри.Период <= Док.ДатаУвольнения
	|			
	|			СГРУППИРОВАТЬ ПО
	|				Док.Сотрудник) КАК СписокДат
	|			ПО ДанныеПоРаботникуДоНазначения.Сотрудник = СписокДат.Сотрудник 
	|				И ДанныеПоРаботникуДоНазначения.Период = СписокДат.ДатаПоследнегоИзменения 
	|				И (ДанныеПоРаботникуДоНазначения.Организация = &ГоловнаяОрганизация)
	|		ПО ДанныеПоРаботникуДоНазначения.Сотрудник = ТЧРаботникиОрганизации.Сотрудник 
	|			И (ДанныеПоРаботникуДоНазначения.Организация = &ГоловнаяОрганизация)		
	|	
	|	    "+?(ОтражатьВУпрУчете,"
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Работники КАК ДанныеПоРаботникуДоНазначенияУпр
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (
	|				ВЫБРАТЬ
	|					Док.Сотрудник КАК Сотрудник,
	|					МАКСИМУМ(СостояниеВнутри.Период) КАК ДатаПоследнегоИзменения
	|				ИЗ РегистрСведений.Работники КАК СостояниеВнутри
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК Док
	|					ПО СостояниеВнутри.Физлицо = Док.Сотрудник.Физлицо 
	|						И (Док.Ссылка = &ДокументСсылка) 
	|						И СостояниеВнутри.Период <= Док.ДатаУвольнения
	|				СГРУППИРОВАТЬ ПО
	|					Док.Сотрудник
	|			) КАК СписокДатУпр
	|			ПО ДанныеПоРаботникуДоНазначенияУпр.ФизЛицо = СписокДатУпр.Сотрудник.ФизЛицо
	|				И ДанныеПоРаботникуДоНазначенияУпр.Период = СписокДатУпр.ДатаПоследнегоИзменения 
	|		ПО ДанныеПоРаботникуДоНазначенияУпр.ФизЛицо = ТЧРаботникиОрганизации.Сотрудник.ФизЛицо 
	|		","") + "
	|	
	|		ЛЕВОЕ СОЕДИНЕНИЕ (
	|	        ВЫБРАТЬ
	|				ТЧРаботникиОрганизации.НомерСтроки КАК НомерСтроки,
	|				МИНИМУМ(ТЧРаботникиОрганизаций2.НомерСтроки) КАК КонфликтнаяСтрокаНомер
	|			ИЗ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК ТЧРаботникиОрганизации
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК ТЧРаботникиОрганизаций2
	|				ПО (ТЧРаботникиОрганизаций2.Ссылка = &ДокументСсылка) 
	|					И ТЧРаботникиОрганизации.Сотрудник = ТЧРаботникиОрганизаций2.Сотрудник 
	|					И ТЧРаботникиОрганизации.НомерСтроки <> ТЧРаботникиОрганизаций2.НомерСтроки
	|			ГДЕ ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка
	|			СГРУППИРОВАТЬ ПО
	|				ТЧРаботникиОрганизации.НомерСтроки
	|	    ) КАК ПересекающиесяСтроки
	|		ПО ТЧРаботникиОрганизации.НомерСтроки = ПересекающиесяСтроки.НомерСтроки
	|		
	|
	|ГДЕ
	|	ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""НачисленияРаботникаОрганизации"",
	|	ТЧРаботникиОрганизации.НомерСтроки,
	|	ТЧРаботникиОрганизации.Сотрудник,
	|	ТЧРаботникиОрганизации.Сотрудник.Наименование,

	|	ТЧРаботникиОрганизации.ДатаУвольнения,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	СписокВидовРасчета.ДокументОснование,
	|	СписокВидовРасчета.ВидРасчетаИзмерение,
	|	СписокВидовРасчета.ВидРасчета,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК ТЧРаботникиОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//|			""НачисленияРаботникаОрганизации"" КАК ВидСтрокиЗапроса,
	|			НачисленияРаботниковОрганизации.Сотрудник КАК Сотрудник,
	|			НачисленияРаботниковОрганизации.ВидРасчетаИзмерение КАК ВидРасчетаИзмерение,
	|			НачисленияРаботниковОрганизации.ВидРасчета КАК ВидРасчета,
	|			NULL КАК ДокументОснование
	|		ИЗ
	|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК НачисленияРаботниковОрганизации
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					НачисленияРаботниковОрганизации.Сотрудник КАК Сотрудник,
	|					НачисленияРаботниковОрганизации.ВидРасчетаИзмерение КАК ВидРасчетаИзмерение,
	|					НачисленияРаботниковОрганизации.ВидРасчета КАК ВидРасчета,
	|					МАКСИМУМ(НачисленияРаботниковОрганизации.Период) КАК ДатаИзмененияРеквизитов
	|				ИЗ
	|					Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК Док
	|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК НачисленияРаботниковОрганизации
	|						ПО Док.Сотрудник = НачисленияРаботниковОрганизации.Сотрудник 
	|							И (НачисленияРаботниковОрганизации.Организация = &ГоловнаяОрганизация)
	|							И Док.ДатаУвольнения >= НачисленияРаботниковОрганизации.Период 
	|							И (Док.Ссылка = &ДокументСсылка) 
	|				
	|				СГРУППИРОВАТЬ ПО
	|					НачисленияРаботниковОрганизации.ВидРасчетаИзмерение,
	|					НачисленияРаботниковОрганизации.Сотрудник,
	|					НачисленияРаботниковОрганизации.ВидРасчета) КАК ДатыНачислений
	|				ПО НачисленияРаботниковОрганизации.Период = ДатыНачислений.ДатаИзмененияРеквизитов 
	|					И НачисленияРаботниковОрганизации.Сотрудник = ДатыНачислений.Сотрудник
	|					И (НачисленияРаботниковОрганизации.Организация = &ГоловнаяОрганизация)
	|					И НачисленияРаботниковОрганизации.ВидРасчетаИзмерение = ДатыНачислений.ВидРасчетаИзмерение
	|					И НачисленияРаботниковОрганизации.ВидРасчета = ДатыНачислений.ВидРасчета
	|					И (НачисленияРаботниковОрганизации.Актуальность = Истина)) КАК СписокВидовРасчета
	|		ПО ТЧРаботникиОрганизации.Сотрудник = СписокВидовРасчета.Сотрудник 
	//|			И (СписокВидовРасчета.ВидСтрокиЗапроса = ""НачисленияРаботникаОрганизации"") 
	|
	|ГДЕ
	|	ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""УдержанияРаботникаОрганизации"",
	|	ТЧРаботникиОрганизации.НомерСтроки,
	|	ТЧРаботникиОрганизации.Сотрудник,
	|	ТЧРаботникиОрганизации.Сотрудник.Наименование,
	|	ТЧРаботникиОрганизации.ДатаУвольнения,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	СписокВидовРасчета.ВидРасчета,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК ТЧРаботникиОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//|			""УдержанияРаботникаОрганизации"" 
	|			УдержанияРаботниковОрганизации.Сотрудник КАК Сотрудник,
	|			УдержанияРаботниковОрганизации.ВидРасчета КАК ВидРасчета
	|		ИЗ
	|			РегистрСведений.ПлановыеУдержанияРаботниковОрганизаций КАК УдержанияРаботниковОрганизации
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					УдержанияРаботниковОрганизации.Сотрудник КАК Сотрудник,
	|					УдержанияРаботниковОрганизации.ВидРасчета КАК ВидРасчета,
	|					МАКСИМУМ(УдержанияРаботниковОрганизации.Период) КАК ДатаИзмененияРеквизитов
	|				ИЗ
	|					Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК Док
	|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеУдержанияРаботниковОрганизаций КАК УдержанияРаботниковОрганизации
	|						ПО Док.Сотрудник = УдержанияРаботниковОрганизации.Сотрудник 
	|							И (УдержанияРаботниковОрганизации.Организация = &ГоловнаяОрганизация)
	|							И Док.ДатаУвольнения >= УдержанияРаботниковОрганизации.Период 
	|							И (Док.Ссылка = &ДокументСсылка) 
	|				
	|				СГРУППИРОВАТЬ ПО
	|					УдержанияРаботниковОрганизации.Сотрудник,
	|					УдержанияРаботниковОрганизации.ВидРасчета) КАК ДатыУдержаний
	|				ПО УдержанияРаботниковОрганизации.Период = ДатыУдержаний.ДатаИзмененияРеквизитов 
	|					И УдержанияРаботниковОрганизации.Сотрудник = ДатыУдержаний.Сотрудник 
	|					И (УдержанияРаботниковОрганизации.Организация = &ГоловнаяОрганизация)
	|					И УдержанияРаботниковОрганизации.ВидРасчета = ДатыУдержаний.ВидРасчета
	|					И (УдержанияРаботниковОрганизации.Актуальность = Истина)) КАК СписокВидовРасчета
	|		ПО ТЧРаботникиОрганизации.Сотрудник = СписокВидовРасчета.Сотрудник 
	|
	|ГДЕ
	|	ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""КонфликтныйДокумент"",
	|	ТЧРаботникиОрганизации.НомерСтроки,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	КонфликтныеДвижения.Регистратор,
	|	NULL
	|ИЗ
	|	Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК ТЧРаботникиОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			РаботникиОрганизации.Период КАК Период,
	|			РаботникиОрганизации.Сотрудник КАК Сотрудник,
	|			РаботникиОрганизации.Регистратор КАК Регистратор
	|		ИЗ
	|			РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
	|		
	|		ГДЕ
	//|			РаботникиОрганизации.Физлицо В(&МассивФизЛиц)) КАК КонфликтныеДвижения
	|			РаботникиОрганизации.Организация = &ГоловнаяОрганизация) КАК КонфликтныеДвижения
	|		ПО КонфликтныеДвижения.Сотрудник= ТЧРаботникиОрганизации.Сотрудник 
	|			И (КонфликтныеДвижения.Период = ДОБАВИТЬКДАТЕ(ТЧРаботникиОрганизации.ДатаУвольнения, ДЕНЬ, 1))
	|
	|ГДЕ
	|	ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка
	|
	|ИТОГИ ПО
	|	НомерСтроки,
	|	ВидСтрокиЗапроса
	|";

	
	Запрос.Текст = ТекстЗапроса;

	Возврат Запрос.Выполнить();
КонецФункции // СформироватьЗапросПоРаботникиОрганизаций()

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//  Отказ 					- флаг отказа в проведении.
//
Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ)

	Если ВыборкаПоШапкеДокумента.ОтражатьВРеглУчете Тогда
		Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Организация) Тогда
			ОбщегоНазначения.ОшибкаПриПроведении(НСтр("ru='Не указана организация!';uk='Не зазначена організація!'"), Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения реквизитов в строке ТЧ "РаботникиОрганизации" документа.
// Если какой-то из реквизтов, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по строке ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//  ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//  							  из результата запроса по товарам документа, 
//  Отказ 						- флаг отказа в проведении.
//
Процедура ПроверитьЗаполнениеСтрокиРаботникаОрганизации(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ)

	СтрокаНачалаСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='В строке номер ""%1"" табл. части ""Работники организации"": ';uk='У рядку номер ""%1"" табл. частини ""Працівники організації"": '"), СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки));

	Если ВыборкаПоСтрокамДокумента.ВидСтрокиЗапроса = "ДанныеДляДвиженийКадров" Тогда

		// ФизЛицо
		НетСотрудника = НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Сотрудник);
		Если НетСотрудника Тогда
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='не выбран сотрудник!';uk='не обраний співробітник!'"), Отказ);
		КонецЕсли;

		// ДатаУвольнения
		НетДатыУвольнения = НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаУвольнения);
		Если НетДатыУвольнения Тогда
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='не указана дата увольнения!';uk='не зазначена дата звільнення!'"), Отказ);
		КонецЕсли;

		Если НетСотрудника ИЛИ НетДатыУвольнения Тогда
			Возврат; // Дальше не проверяем
		КонецЕсли;	

		
		Если ВыборкаПоШапкеДокумента.ОтражатьВРеглУчете Тогда
			// Приказ
		
			Если ВыборкаПоСтрокамДокумента.ОшибкаНеСоответствиеОрганизацииПриказаОПриеме Тогда
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru=' указанный приказ о приеме оформлен на другую организацию!';uk=' вказаний наказ про прийом оформлений на іншу організацію!'"), Отказ);
			ИначеЕсли ВыборкаПоСтрокамДокумента.ОшибкаВПриказеОПриемеНетФизЛица Тогда
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru=' работник и приказ о приеме не соответствуют друг другу!';uk=' працівник і наказ про прийом не відповідають один одному!'"), Отказ);
			КонецЕсли;
		КонецЕсли;

		Если ВыборкаПоШапкеДокумента.ОтражатьВУпрУчете и ВыборкаПоСтрокамДокумента.УвольнятьВУпрУчете Тогда

			Уволен = Ложь;
			УжеРаботает = РегистрыСведений.Работники.СрезПоследних(ВыборкаПоСтрокамДокумента.ДатаУвольнения, Новый Структура("ФизЛицо",ВыборкаПоСтрокамДокумента.Сотрудник.ФизЛицо));
			Для каждого Место из УжеРаботает Цикл
				Если Место.ЗанимаемыхСтавок = 0 Тогда
					Уволен = Истина;
				КонецЕсли;
			КонецЦикла;
			Если УжеРаботает.Количество()=0 ИЛИ Уволен Тогда
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='работник не принят на работу на предприятие!';uk='працівник не прийнятий на роботу на підприємство!'"),Отказ);
			КонецЕсли;

		КонецЕсли;	
			
		// Проверка: противоречие другой строке документа
		Если ВыборкаПоСтрокамДокумента.КонфликтнаяСтрокаНомер <> NULL Тогда
			СтрокаСообщениеОбОшибке = НСтр("ru='работник не может быть указан в документе дважды (см. строку ';uk='працівник не може бути зазначений у документі двічі (див. рядок '") + ВыборкаПоСтрокамДокумента.КонфликтнаяСтрокаНомер + ")!"; 
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщениеОбОшибке, Отказ);
		КонецЕсли;	

	ИначеЕсли ВыборкаПоСтрокамДокумента.ВидСтрокиЗапроса = "КонфликтныйДокумент" Тогда	

		// противоречие другим кадровым приказам
		СтрокаСообщениеОбОшибке = НСтр("ru='возникает противоречие кадровому приказу ';uk='виникає протиріччя кадровому наказу '") + Символы.ПС + Символы.Таб + ВыборкаПоСтрокамДокумента.КонфликтныйДокумент + "!"; 
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщениеОбОшибке, Отказ);

	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеСтрокиРаботникаОрганизации()

// По строке выборки результата запроса по документу формируем движения по регистрам
//
// Параметры: 
//  ВыборкаПоШапкеДокумента      	- выборка из результата запроса по шапке документа,
//  ВыборкаПоРаботникиОрганизации 	- выборка из результата запроса по табличной части документа
//
// Возвращаемое значение:
//  Нет.
//
Процедура ДобавитьСтрокуВДвиженияПоРегистрамСведений(ВыборкаПоШапкеДокумента, ВыборкаПоРаботникиОрганизации)
	
	Если ВыборкаПоШапкеДокумента.ОтражатьВРеглУчете Тогда
	
		Если ВыборкаПоРаботникиОрганизации.ВидСтрокиЗапроса = "ДанныеДляДвиженийКадров" Тогда
			
			//// Если документ нужно проводить по регистру, то для него есть ключ в структуре
			Движение = Движения.РаботникиОрганизаций.Добавить();
			
			// Свойства
			Движение.Период                     = КонецДня(ВыборкаПоРаботникиОрганизации.ДатаУвольнения);
			
			// Измерения
			Движение.Сотрудник                    = ВыборкаПоРаботникиОрганизации.Сотрудник;
			Движение.Организация           		= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
			// Ресурсы
			Движение.ПодразделениеОрганизации	= ВыборкаПоРаботникиОрганизации.ПрежнееПодразделение;

			// не записываем значения для этих ресурсов:
			//Движение.Должность
			
			// Реквизиты
			Движение.ПричинаИзмененияСостояния  = Перечисления.ПричиныИзмененияСостояния.Увольнение;
			Движение.СтатьяКЗоТ  = ВыборкаПоРаботникиОрганизации.ОснованиеУвольнения;
			Если ВыборкаПоРаботникиОрганизации.Сотрудник.ВидЗанятости <> Перечисления.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство Тогда
				
				// Льготы работника	
				Запрос = Новый Запрос;
				Запрос.Текст = "
				|ВЫБРАТЬ
				|	Льготы.Организация,
				|	Льготы.Сотрудник,
				|	Льготы.Льгота,
				|   Льготы.Актуальность,
				|	Льготы.Период
				|
				|ИЗ
				|	РегистрСведений.ЛьготыРаботниковОрганизаций.СрезПоследних(&Дата)	КАК Льготы
				|
				|ГДЕ
				|	Льготы.Организация 	= &Организация
				| И Льготы.Сотрудник		= &Работник
				|
				|";
				
				Запрос.УстановитьПараметр("Организация"	, ВыборкаПоРаботникиОрганизации.ПрежняяОрганизация);
				Запрос.УстановитьПараметр("Работник"	, ВыборкаПоРаботникиОрганизации.Сотрудник);
				Запрос.УстановитьПараметр("Дата"		, ВыборкаПоРаботникиОрганизации.ДатаУвольнения);
				Выборка = Запрос.Выполнить().Выбрать();
				мОтказ = ложь;
				
				ИспользуетсяНК = ПроведениеРасчетов.ИспользуетсяНК(ВыборкаПоРаботникиОрганизации.ДатаУвольнения);
				
				Пока Выборка.Следующий() Цикл
					Если Выборка.Актуальность = Истина Тогда
						
						
						Движение = Движения.ЛьготыРаботниковОрганизаций.Добавить();		
						// Свойства
						Движение.Период 					= НачалоМесяца(ВыборкаПоРаботникиОрганизации.ДатаУвольнения);
						Если НЕ ИспользуетсяНК Тогда
							Движение.Период						= НачалоМесяца(ВыборкаПоРаботникиОрганизации.ДатаУвольнения);				
						Иначе
							//Льгота применяется в месяце увольнения
							Движение.Период						= КонецМесяца(ВыборкаПоРаботникиОрганизации.ДатаУвольнения)+1;				
						КонецЕсли;
						
						// Измерения
						Движение.Сотрудник                    = Выборка.Сотрудник;
						Движение.Организация           		= Выборка.Организация;
						Движение.Льгота						= Выборка.Льгота;
						
						// Ресурсы
						Движение.Актуальность				= Ложь;
					КонецЕсли;		
				КонецЦикла;
				
				
				
				// Взносы в фонды работника
				Запрос.Текст = "
				|ВЫБРАТЬ
				|	Взносы.Организация,
				|	Взносы.Сотрудник,
				|	Взносы.Налог,
				|   Взносы.Актуальность
				|
				|ИЗ
				|	РегистрСведений.ВзносыВФондыРаботниковОрганизаций.СрезПоследних(&Дата)	КАК Взносы
				|
				|ГДЕ
				|	Взносы.Организация 	= &Организация
				| И Взносы.Сотрудник		= &Работник
				|
				|";
				
				Запрос.УстановитьПараметр("Организация"	, ВыборкаПоРаботникиОрганизации.ПрежняяОрганизация);
				Запрос.УстановитьПараметр("Работник"	, ВыборкаПоРаботникиОрганизации.Сотрудник);
				Запрос.УстановитьПараметр("Дата"		, ВыборкаПоРаботникиОрганизации.ДатаУвольнения);
				Выборка = Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл
					Если Выборка.Актуальность = Истина Тогда
						Движение = Движения.ВзносыВФондыРаботниковОрганизаций.Добавить();		
						// Свойства
						Движение.Период                     = КонецДня(ВыборкаПоРаботникиОрганизации.ДатаУвольнения);
						
						// Измерения
						Движение.Сотрудник                    = Выборка.Сотрудник;
						Движение.Организация           		= Выборка.Организация;
						Движение.Налог						= Выборка.Налог;
						
						// Ресурсы
						Движение.Актуальность				= Ложь;
					КонецЕсли;		
				КонецЦикла;
				
			КонецЕсли;
			
		ИначеЕсли ВыборкаПоРаботникиОрганизации.ВидСтрокиЗапроса = "НачисленияРаботникаОрганизации" И ЗначениеЗаполнено(ВыборкаПоРаботникиОрганизации.ВидРасчета) Тогда
			
			
			Движение = Движения.ПлановыеНачисленияРаботниковОрганизаций.Добавить();
			
			// Свойства
			Движение.Период			= КонецДня(ВыборкаПоРаботникиОрганизации.ДатаУвольнения);
			
			// Измерения
			Движение.Сотрудник		= ВыборкаПоРаботникиОрганизации.Сотрудник;
			Движение.ВидРасчетаИзмерение = ВыборкаПоРаботникиОрганизации.ВидРасчетаИзмерение;
						
			// Ресурсы
			Движение.Актуальность		= Ложь;
			Движение.ВидРасчета		= ВыборкаПоРаботникиОрганизации.ВидРасчета;

			// Реквизиты
			Движение.Организация	= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
			
		ИначеЕсли ВыборкаПоРаботникиОрганизации.ВидСтрокиЗапроса = "УдержанияРаботникаОрганизации" Тогда
			
			
			Движение = Движения.ПлановыеУдержанияРаботниковОрганизаций.Добавить();
			
			// Свойства
			Движение.Период			= КонецДня(ВыборкаПоРаботникиОрганизации.ДатаУвольнения);
			
			// Измерения
			Движение.Сотрудник		= ВыборкаПоРаботникиОрганизации.Сотрудник;
			Движение.ВидРасчета		= ВыборкаПоРаботникиОрганизации.ВидРасчета;
			
			// Ресурсы
			Движение.Актуальность		= Ложь;
			
			// Реквизиты
			Движение.Организация	= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
			
		КонецЕсли; 
	КонецЕсли;

	Если ВыборкаПоШапкеДокумента.ОтражатьВУпрУчете Тогда
	
		Если ВыборкаПоРаботникиОрганизации.ВидСтрокиЗапроса = "ДанныеДляДвиженийКадров" Тогда
			
			Если ВыборкаПоРаботникиОрганизации.УвольнятьВУпрУчете тогда
			
				//// Если документ нужно проводить по регистру, то для него есть ключ в структуре
				Движение = Движения.Работники.Добавить();
				
				// Свойства
				Движение.Период                     = КонецДня(ВыборкаПоРаботникиОрганизации.ДатаУвольнения);
				
				// Измерения
				Движение.ФизЛицо                    = ВыборкаПоРаботникиОрганизации.Сотрудник.ФизЛицо;
				
				УжеРаботает = РегистрыСведений.Работники.СрезПоследних(ВыборкаПоРаботникиОрганизации.ДатаУвольнения, Новый Структура("ФизЛицо",ВыборкаПоРаботникиОрганизации.Сотрудник.ФизЛицо));
				Для каждого Место из УжеРаботает Цикл
					Если Место.ЗанимаемыхСтавок > 0 Тогда
						Движение.Подразделение				= Место.Подразделение;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				
				// Ресурсы
				Движение.Подразделение				= ВыборкаПоРаботникиОрганизации.ПрежнееПодразделениеУпр;
				// не записываем значения для этих ресурсов:
				//Движение.Должность
				
				// Реквизиты
				Движение.ПричинаИзмененияСостояния  = Перечисления.ПричиныИзмененияСостояния.Увольнение;
				Движение.ПричинаУвольнения  = ВыборкаПоРаботникиОрганизации.ПричинаУвольнения;
			КонецЕсли;
			
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамСведений



////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если мУдалятьДвижения Тогда
    	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	РезультатЗапросаПоШапке = СформироватьЗапросПоШапке(Режим);

	// Получим реквизиты шапки из запроса
	ВыборкаПоШапкеДокумента = РезультатЗапросаПоШапке.Выбрать();
	Если ВыборкаПоШапкеДокумента.Следующий() Тогда

		//Надо позвать проверку заполнения реквизитов шапки
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ);

		// Движения стоит добавлять, если в проведении еще не отказано (отказ =ложь)
		Если НЕ Отказ Тогда

			// получим реквизиты табличной части
			РезультатЗапросаПоРаботники = СформироватьЗапросПоРаботникиОрганизаций(ВыборкаПоШапкеДокумента, Режим);
         	ВыборкаПоСтрокамДокумента = РезультатЗапросаПоРаботники.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

			// обходим строки документа
			Пока ВыборкаПоСтрокамДокумента.Следующий() Цикл 

				// выберем все виды строк запроса для текущей строки документа
				ВыборкаПоВидамСтрокЗапроса = ВыборкаПоСтрокамДокумента.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаПоВидамСтрокЗапроса.Следующий() Цикл 

					// Для каждого вида строки запроса свои проверки
					ВидСтрокиЗапроса = ВыборкаПоВидамСтрокЗапроса.ВидСтрокиЗапроса;
					ВыборкаСтрокЗапроса = ВыборкаПоВидамСтрокЗапроса.Выбрать();


					// обходим строки запроса, проверяем данные и формируем движения
					Пока ВыборкаСтрокЗапроса.Следующий() Цикл
						
						ПроверитьЗаполнениеСтрокиРаботникаОрганизации(ВыборкаПоШапкеДокумента, ВыборкаСтрокЗапроса , Отказ);
						Если НЕ Отказ Тогда
							ДобавитьСтрокуВДвиженияПоРегистрамСведений(ВыборкаПоШапкеДокумента, ВыборкаСтрокЗапроса);
						КонецЕсли;  
						
					КонецЦикла;					

				КонецЦикла;

			КонецЦикла; 

		КонецЕсли; 

	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроцедурыУправленияПерсоналом.ЗаполнитьФизЛицоПоТЧ(РаботникиОрганизации);
	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(РаботникиОрганизации);

	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	
	ТипОснования = ТипЗнч(Основание);	
	Если ТипОснования = Тип("СправочникСсылка.СотрудникиОрганизаций") Тогда	
		
		Если Основание.ВидДоговора <> Перечисления.ВидыДоговоровСФизЛицами.ТрудовойДоговор Тогда
			Возврат;
		КонецЕсли;
		
		Если Не Основание.ОбособленноеПодразделение.Пустая() Тогда
			Организация = Основание.ОбособленноеПодразделение;
		Иначе
			Организация = Основание.Организация;
		КонецЕсли;
		
		НоваяСтрока = РаботникиОрганизации.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Основание);
		НоваяСтрока.Сотрудник = Основание;
		
		НоваяСтрока.ДатаУвольнения = ТекущаяДата();
		
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры

мДлинаСуток = 86400;
